---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.TextElementType
source: html/4d42ad90-d090-016e-e6c2-32b54a8a9663.htm
---
# TextElementType Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.